""" <재귀함수가 뭔가요?> https://www.acmicpc.net/problem/17478 """

""" solution-1 반복문 풀이 """

def question(N):
    print('어느 한 컴퓨터공학과 학생이 유명한 교수님을 찾아가 물었다.')
    for i in range(N+1):
        sign = '____' * i
        print(f'{sign}"재귀함수가 뭔가요?"')
        if i != N:
            print(f'{sign}"잘 들어보게. 옛날옛날 한 산 꼭대기에 이세상 모든 지식을 통달한 선인이 있었어.')
            print(f'{sign}마을 사람들은 모두 그 선인에게 수많은 질문을 했고, 모두 지혜롭게 대답해 주었지.')
            print(f'{sign}그의 답은 대부분 옳았다고 하네. 그런데 어느 날, 그 선인에게 한 선비가 찾아와서 물었어."')
        else:
            print(f'{sign}"재귀함수는 자기 자신을 호출하는 함수라네"')
    
    for j in range(N,-1,-1):
        sign = '____' * j
        print(f'{sign}라고 답변하였지.')


N = int(input())
question(N)



""" solution-2 재귀 풀이 """

def question(depth, max_depth):
    sign = '____' * depth
    if depth == max_depth:
        return f'''{sign}"재귀함수가 뭔가요?"
{sign}"재귀함수는 자기 자신을 호출하는 함수라네"
{sign}라고 답변하였지.'''
    else:
        sentence = f'''{sign}"재귀함수가 뭔가요?"
{sign}"잘 들어보게. 옛날옛날 한 산 꼭대기에 이세상 모든 지식을 통달한 선인이 있었어.
{sign}마을 사람들은 모두 그 선인에게 수많은 질문을 했고, 모두 지혜롭게 대답해 주었지.
{sign}그의 답은 대부분 옳았다고 하네. 그런데 어느 날, 그 선인에게 한 선비가 찾아와서 물었어."
'''
    return f'{sentence}{question(depth+1, max_depth)}\n{sign}라고 답변하였지.'


N = int(input())
print('어느 한 컴퓨터공학과 학생이 유명한 교수님을 찾아가 물었다.',question(0,N))



"""
<작동방식>
ex) input = 4일 때,
question(0,4) 호출!
f'{sentence}{question(1, 4)}
    f'{sentence}{question(2, 4)}
        f'{sentence}{question(3, 4)}
            f'{sentence}{question(4, 4)}
                
                return "재귀함수는 자기 자신을 호출하는 함수..."(sign 4번)
            retun \n{sign}라고 답변하였지.' (sign 3번)
        \n{sign}라고 답변하였지.' (sign 2번)
    \n{sign}라고 답변하였지.' (sign 1번)
\n{sign}라고 답변하였지.' (sign 0번)

"""


############################################################################################

# # TestCase1
# 어느 한 컴퓨터공학과 학생이 유명한 교수님을 찾아가 물었다.
# "재귀함수가 뭔가요?"
# "잘 들어보게. 옛날옛날 한 산 꼭대기에 이세상 모든 지식을 통달한 선인이 있었어.
# 마을 사람들은 모두 그 선인에게 수많은 질문을 했고, 모두 지혜롭게 대답해 주었지.
# 그의 답은 대부분 옳았다고 하네. 그런데 어느 날, 그 선인에게 한 선비가 찾아와서 물었어."
# ____"재귀함수가 뭔가요?"
# ____"잘 들어보게. 옛날옛날 한 산 꼭대기에 이세상 모든 지식을 통달한 선인이 있었어.
# ____마을 사람들은 모두 그 선인에게 수많은 질문을 했고, 모두 지혜롭게 대답해 주었지.
# ____그의 답은 대부분 옳았다고 하네. 그런데 어느 날, 그 선인에게 한 선비가 찾아와서 물었어."
# ________"재귀함수가 뭔가요?"
# ________"재귀함수는 자기 자신을 호출하는 함수라네"
# ________라고 답변하였지.
# ____라고 답변하였지.
# 라고 답변하였지.


# # TestCase2
# 어느 한 컴퓨터공학과 학생이 유명한 교수님을 찾아가 물었다.
# "재귀함수가 뭔가요?"
# "잘 들어보게. 옛날옛날 한 산 꼭대기에 이세상 모든 지식을 통달한 선인이 있었어.
# 마을 사람들은 모두 그 선인에게 수많은 질문을 했고, 모두 지혜롭게 대답해 주었지.
# 그의 답은 대부분 옳았다고 하네. 그런데 어느 날, 그 선인에게 한 선비가 찾아와서 물었어."
# ____"재귀함수가 뭔가요?"
# ____"잘 들어보게. 옛날옛날 한 산 꼭대기에 이세상 모든 지식을 통달한 선인이 있었어.
# ____마을 사람들은 모두 그 선인에게 수많은 질문을 했고, 모두 지혜롭게 대답해 주었지.
# ____그의 답은 대부분 옳았다고 하네. 그런데 어느 날, 그 선인에게 한 선비가 찾아와서 물었어."
# ________"재귀함수가 뭔가요?"
# ________"잘 들어보게. 옛날옛날 한 산 꼭대기에 이세상 모든 지식을 통달한 선인이 있었어.
# ________마을 사람들은 모두 그 선인에게 수많은 질문을 했고, 모두 지혜롭게 대답해 주었지.
# ________그의 답은 대부분 옳았다고 하네. 그런데 어느 날, 그 선인에게 한 선비가 찾아와서 물었어."
# ____________"재귀함수가 뭔가요?"
# ____________"잘 들어보게. 옛날옛날 한 산 꼭대기에 이세상 모든 지식을 통달한 선인이 있었어.
# ____________마을 사람들은 모두 그 선인에게 수많은 질문을 했고, 모두 지혜롭게 대답해 주었지.
# ____________그의 답은 대부분 옳았다고 하네. 그런데 어느 날, 그 선인에게 한 선비가 찾아와서 물었어."
# ________________"재귀함수가 뭔가요?"
# ________________"재귀함수는 자기 자신을 호출하는 함수라네"
# ________________라고 답변하였지.
# ____________라고 답변하였지.
# ________라고 답변하였지.
# ____라고 답변하였지.
# 라고 답변하였지.



